{
  "prompt1": {
    "type": "Light-Hearted",
    "questions": [
      "What's the funniest thing that happened to you this week?",
      "If you could have any superpower for just one day, what would it be?",
      "What's your go-to dance move when no one's watching?",
      "If you were a flavor of ice cream, what would you be and why?",
      "What's the most ridiculous thing you've ever convinced someone was true?",
      "If you could be famous for something completely silly, what would it be?",
      "What's your most embarrassing autocorrect fail?",
      "If you had to describe yourself using only emojis, which ones would you pick?",
      "What's the weirdest food combination you actually enjoy?",
      "If you could have a conversation with any cartoon character, who would it be?"
    ]
  },
  "prompt2": {
    "type": "Moderately Reflective",
    "questions": [
      "What's a small change you made recently that had a bigger impact than expected?",
      "How do you usually recharge when you're feeling overwhelmed?",
      "What's something you've learned about yourself in the past year?",
      "If you could give your younger self one piece of advice, what would it be?",
      "What's a habit you're trying to build or break right now?",
      "How do you define success for yourself?",
      "What's something you're grateful for that you often take for granted?",
      "If you could spend a day in someone else's shoes, whose would you choose?",
      "What's a goal you've been putting off and why?",
      "How do you handle it when things don't go according to plan?"
    ]
  },
  "prompt3": {
    "type": "Deep & Vulnerable",
    "questions": [
      "What's something you've never told anyone but wish you could?",
      "What's your biggest fear about the future?",
      "If you could forgive someone (including yourself), who would it be?",
      "What's a moment in your life you wish you could do over?",
      "What's something you're struggling with that you wish others understood?",
      "If you could have one difficult conversation, who would it be with and what would you say?",
      "What's a part of yourself you've been hiding that you want to embrace?",
      "What's something you've lost that you still grieve?",
      "If you could ask your future self one question, what would it be?",
      "What's a truth about yourself that's hard to accept but important to acknowledge?"
    ]
  }
}
